barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/gpio_per.c
#include "gpio_per.h"   
#include "hal_uart.h"
#include "hal_flash.h"
#include "math.h"
#include "stdio.h"
#include "apl.h"
#include "string.h"
#include "hal_led.h"
#include "hal_timer.h"
#include "stm32f0xx_adc.h"
#include <sys/clock.h>

#define UI_220    220.0
#define IB_05     0.5

#define SAFE_START_TIME      30000       //30S
#define SAVE_DATA_PERIOD     30000      //1分钟

extern char g_updateBuffer[];
extern char *paralist[];
extern USART_TypeDef *COM_USART[];
   
static bool  flash_ok        = true;

PROCESS_NAME(period_save_data_process);


RN8209C_PARAM rn8209c_papameter = 
{
      .HFConst      = 2484,              //表常数项设置
      .PStart       = 0,                 //启动设置
      .GPQA         = 0,                 //A有功增益校正
      .PhsA         = 0,                 //A有功角度校正 
      .QPhsCal      = 0,                 //无功角度校正
      .PFcount      = 0,                 //保存的能量积分，掉电时保存
      .energyAPulse = 0,                 //有功电量，电量小于一度电，以脉冲数表示   
      .Ku           = 0,                 //电压系数   mv                              
      .KIa          = 0,                 //电流A系数  ma
      .Kp           = 0.0,            //功率系数   uW ,手动计算结果，若修改参数，必须手动修改
      .Uv           = 0,                 //电压有效值
      .Ia           = 0,                 //电流有效值
      .Pa           = 0,                 //功率有效值
      .ChkSum       = 0,                 //校验和
      .calibration  = 0,                 //电表是否校准
      .EC           = 12800,
      .pwmValue     = 100,
      .lightTime    = 0,
 };

/*
关灯
define relay_open()  
开灯
define relay_close()
读取电量
read_8209c_energyP()
读电压
read_8209c_U()
读电流
read_8209c_Ia()
读功率
read_8209c_Pa()
调光
set_PWM(u8 PWMx, u8 PWMdiv)
检测调光电压
read_PWM_volt()
检测灯状态
read_LED_state()
*/

/***************
计量需要保存的参数
0、calibration     是否成功校准  1byte
1、PStart          启动电流      2byte
2、GPQA            有功功率校准  2byte
3、PhsA            有功角度校准  1byte 
4、QPhsCal         无功校准      2byte
5、Ku              电压系数      3byte                                                   
6、KIa             电流系数      3byte                     
7、CRC16           校验          2byte
多字节数据地位在地地址，高位在高地址
***************/
#define PARAM_CAL                0
#define PARAM_PSTART             1
#define PARAM_GPQA               2
#define PARAM_PHSA               3
#define PARAM_QPHCAL             4
#define PARAM_KU                 5
#define PARAM_KI                 6
#define PARAM_CRC16              7

#define CAL_LENGTH               1
#define PSTART_LENGTH            2
#define GPQA_LENGTH              2
#define PHSA_LENGTH              1
#define QPHCAL_LENGTH            2
#define KU_LENGTH                3
#define KI_LENGTH                3
#define CRC16_LENGTH             2
#define PARAM_LENGTH             (CAL_LENGTH + PSTART_LENGTH + GPQA_LENGTH + PHSA_LENGTH + QPHCAL_LENGTH + KU_LENGTH + KI_LENGTH + CRC16_LENGTH)


#define CAL_STRAT_POS           0
#define PSTART_START_POS        (CAL_STRAT_POS    + CAL_LENGTH)
#define GPQA_START_POS          (PSTART_START_POS + PSTART_LENGTH)
#define PHSA_START_POS          (GPQA_START_POS   + GPQA_LENGTH)
#define QPHCAL_START_POS        (PHSA_START_POS   + PHSA_LENGTH)
#define KU_START_POS            (QPHCAL_START_POS + QPHCAL_LENGTH)
#define KI_START_POS            (KU_START_POS     + KU_START_POS)
#define CRC16_START_POS         (KI_START_POS     + KI_LENGTH)

u8 cal_param_index[8][2] = {
                                {CAL_STRAT_POS,CAL_LENGTH},      {PSTART_START_POS,PSTART_LENGTH},
                                {GPQA_START_POS,GPQA_LENGTH},    {PHSA_START_POS,PHSA_LENGTH},
                                {QPHCAL_START_POS,QPHCAL_LENGTH},{KU_START_POS,KU_LENGTH},
                                {CRC16_START_POS,KI_LENGTH},     {CRC16_START_POS,CRC16_LENGTH}
                          };

//查找参数
//写入参数

#if 0
bool find_params(u8 pos, void * val)
{
    u8 param_pos;
    u8 param_len;
    u16 crcval;
    
    read_flash(FLASH_PARAMETER_ADDRESS, g_updateBuffer, PARAM_LENGTH);

    crcval = GetCRC16(g_updateBuffer, PARAM_LENGTH - 2);

    if (crcval != (g_updateBuffer[PARAM_LENGTH - 1])*256 + g_updateBuffer[PARAM_LENGTH - 2])
    {
        return false;
    }

  
    if (pos > 7)
    {
        return false;
    }

    param_pos = cal_param_index[pos][0];
    param_len = cal_param_index[pos][1];

    if ((param_len != 1) || (param_len != 2) || (param_len != 3))
    {
        return false;
    }

    switch (param_len)
    {
        case 1:
           *(u8*)val =  g_updateBuffer[param_pos];
        break;

        case 2:
            *(u16*)val = (u16)g_updateBuffer[param_pos]  + (u16)g_updateBuffer[param_pos + 1]<<8;
            
        break;

        case 3:
            *(u32*)val = (u32)g_updateBuffer[param_pos]  + (u32)g_updateBuffer[param_pos + 1]<<8 + (u32)g_updateBuffer[param_pos + 2] <<16;
        break;

        default:
        break;
    } 

    return true;
}
#endif


/****************************************************************
存在掉电马上恢复，单片机没有复位的情况，或者掉电检测错误的处理
掉电检测成功后，kill 掉flash保存进程，启动安全时间检测进程，若进程检测成功，再使能flash处理，掉电检测功能
contiki 由一个进程结束另一个进程
****************************************************************/

/*****************************************************************************
 Prototype    : drop_down_timer_init
 Description  : 初始化掉电检测定时器，定时器超时，表示掉电时间发生。
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void drop_down_timer_init(void)
{
  TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
  
  RCC_APB1PeriphClockCmd(POWER_DOWN_TIMER_SCK, ENABLE);
  
  TIM_TimeBaseInitStruct.TIM_ClockDivision      =  TIM_CKD_DIV4;
  TIM_TimeBaseInitStruct.TIM_CounterMode        =  TIM_CounterMode_Up; 
  TIM_TimeBaseInitStruct.TIM_Prescaler          =   48000;              // 定时周期1ms
  TIM_TimeBaseInitStruct.TIM_Period             =   40;                 // 定时40ms
  TIM_TimeBaseInitStruct.TIM_RepetitionCounter  =   0;
  TIM_TimeBaseInit(POWER_DOWN_TIMER, &TIM_TimeBaseInitStruct);
  
  TIM_ClearFlag(POWER_DOWN_TIMER,  TIM_FLAG_Update);
  TIM_ITConfig(POWER_DOWN_TIMER, TIM_IT_Update,  ENABLE);
}



/*****************************************************************************
 Prototype    : start_time_detect_process
 Description  : 上电保护进程，上电后在保护时间 SAFE_START_TIME 内，不允许操作flash，以及执行掉电保护功能
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
PROCESS(start_time_detect_process, "safe_start");
PROCESS_THREAD(start_time_detect_process, ev, data)
{
    static struct etimer start_etimer; 
    
    static u16 length;
    
    PROCESS_BEGIN();
    
    rn8209c_init();
    
