barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/gpio_per.c
  init_8209c_params();
}

/*****************************************************************************
 Prototype    : select_length
 Description  : 由寄存器号判断寄存器长度
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u8 select_length(u8 reg)
{
  u8 length; 
   
  switch (reg)
  {
    case 0x07:
    case 0x08:
    case 0x40:  
    case 0x41:
    case 0x42:
    case 0x43:
      length = 1;
    break;

    case 0x22:
    case 0x23:
    case 0x24:
    case 0x29:
    case 0x2a:
    case 0x2b:
    case 0x2c: 
    case 0x2d:
    case 0x30:
    case 0x31:
    case 0x32:
    case 0x35:
    case 0x7f:
      length = 3;
      break;
      
    case 0x26: 
    case 0x27:
    case 0x28:
    case 0x44:
      length = 4;
      break;
      
    default:
      length = 2;
       break;
  }
  
  return length;
}

/*****************************************************************************
 Prototype    : config_8209c_reg
 Description  : 写计量寄存器
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void config_8209c_reg(u8 reg, u32 dat)
{
  u8 buf[4] = {0};
  u8 length;
  
  buf[0]= (u8)((dat >> 24)&0xFF);
  buf[1]= (u8)((dat >> 16)&0xFF);
  buf[2]= (u8)((dat >> 8)&0xFF);
  buf[3]= (u8)((dat)&0xFF);
  
 length = select_length(reg);
 
  rn8209c_write_byte(CMDREG, WRITE_ENABLE);
  
  rn8209c_write(reg, &buf[4-length], length);
  
  rn8209c_write_byte(CMDREG, WRITE_DISABLE);
}

/*****************************************************************************
 Prototype    : read_8209c_regs
 Description  : 读计量寄存器
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u8 read_8209c_regs(u8 reg , void* dat)
{
  u8 length;
  u8 buf[5] = {0};
  
  if (reg > 0x7f)
  {
    return false;
  }
  
  length = select_length(reg);
  
  if (rn8209c_read(reg, buf, length) == true)
  {
      if (length == 1)
      {
        *((u8*)dat) = buf[0];
      }
      else if (length == 2)
      {
        *((u16*)dat) = (u32)(buf[0]*256 +buf[1]);
      }
      else if (length == 3)
      {
        *((u32*)dat) = (u32)(buf[0]*65536 +buf[1]*256 + buf[2]);
      }
      else if (length == 4)
      {
        *((u32*)dat) = (u32)(buf[0]*16777216 +buf[1]*65536 + buf[2]*256 + buf[3]);
      }
      
      return length;
  }
  else
  {
    return 0;
   
  }
  
}

/*****************************************************************************
 Prototype    : rn8209c_checkSum
 Description  : 8209c是否交表设置好校验和计算
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u16 rn8209c_checkSum(void)
{
  /* 此处表示从 0x00~0x17寄存器的校验，双字节累加后取反*/
  u16 sum = 0;
  u32 tempVal = 0;
  
  for (u8 i =0; i < 0x18; i ++)
  {
      read_8209c_regs(i ,&tempVal);
      
      sum += tempVal;
  }
  return (~sum);
}

/*****************************************************************************
 Prototype    : find_free_addr
 Description  : 查找flash中空闲可写入位置
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u16 find_free_addr(u32 addr)
{
  u8 temp;
  
  u16 i;
  
   for ( i = 0; i < (1024 / ELC_FLIE_LEN); i++)
  {
     temp  = *((char*)(addr +i*ELC_FLIE_LEN));
     
     if (temp == 0xFF)
     {
       break;
     }
  }
  
  return i*ELC_FLIE_LEN;
}

/*****************************************************************************
 Prototype    : save_8209c_params
 Description  : 保存校表数据，一般只在校表时保存一次，以后不再修改
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void save_8209c_params(void)
{
  u16 len;
  u16 crcVal;
  
  MemSet(g_updateBuffer, 0, 1024);
  
  /* sprintf 应该会自动在末尾添加 0 */
  sprintf(g_updateBuffer,"%s%d;%s%d;%s%d;%s%d;%s%d;%s%d;%s%d;%s%.3f;end",             
          paralist[0],rn8209c_papameter.calibration,
          paralist[1],rn8209c_papameter.PStart,
          paralist[2],rn8209c_papameter.GPQA,
          paralist[3],rn8209c_papameter.PhsA,
          paralist[4],rn8209c_papameter.QPhsCal,
          paralist[5],rn8209c_papameter.Ku,
          paralist[6],rn8209c_papameter.KIa,
          paralist[7],rn8209c_papameter.Kp
          );
  
   len = strlen(g_updateBuffer);
   
   crcVal = GetCRC16((u8*)g_updateBuffer,len);
   
   g_updateBuffer[len]       = (u8)((crcVal >> 8) &0xFF);
   g_updateBuffer[len + 1 ]  = (u8)(crcVal & 0xFF);
   g_updateBuffer[len + 2 ]  = 0;
    

   if (FLASH_ErasePage(FLASH_PARAMETER_ADDRESS) == FLASH_COMPLETE)
   {
      if ( FLASH_Write_chars( FLASH_PARAMETER_ADDRESS, (u8*)g_updateBuffer ,  len + 3 ) != FLASH_OK)
      {
        printf("save calibration data error\r\n");
      }
   }
   else
   {
     printf("save calibration data error\r\n");
   }
}

/*****************************************************************************
 Prototype    : set_8209c_params
 Description  : 将校表参数写入寄存器，一般在上电初始化时使用
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void set_8209c_params(void)
{
  u32 status;
  
  config_8209c_reg(ADHFConst, rn8209c_papameter.HFConst);
  config_8209c_reg(ADPStart, rn8209c_papameter.PStart);
  config_8209c_reg(ADGPQA, rn8209c_papameter.GPQA);
  config_8209c_reg(ADPhsA, rn8209c_papameter.PhsA);
  config_8209c_reg(ADPFCnt, rn8209c_papameter.PFcount);
  
  //Delayms(1);
  
  read_8209c_regs(ADEMUStatus , &status);
  
