barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/gpio_per.c
  rn8209c_papameter.ChkSum = rn8209c_checkSum();
  
  if ( (status & 0x10000) == 0)
  {
    if (rn8209c_papameter.ChkSum  == (status & 0xFFFF))
    {
       /* 计量状态正常 */
       status = 1;
    }
  }
}

/*****************************************************************************
 Prototype    : find_old_data
 Description  : 寻找旧的有的协议
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
bool find_old_data(u16 length)
{
   int tempi;
   u16 crcval;
   
   /* 如果数据校验错误，则回滚去读以前的数据 */
   for ( tempi = length; tempi >= 0 ; )
   {
       read_flash(FLASH_ELC_SAVE_ADDRESS + length - ELC_FLIE_LEN, (u8*)g_updateBuffer, ELC_FLIE_LEN);

       crcval = (u16)((u16)g_updateBuffer[FLASH_CRC_PINT]*256 + g_updateBuffer[FLASH_CRC_PINT + 1]);

       if (GetCRC16((u8*)g_updateBuffer,FLASH_CRC_PINT) == crcval)
       {
           rn8209c_papameter.PFcount       = (u16)(g_updateBuffer[FLASH_PFCOUNT_POINT]*256 +g_updateBuffer[FLASH_PFCOUNT_POINT + 1]);
           rn8209c_papameter.energyAPulse  = (u32)(g_updateBuffer[FLASH_ENERGY_POINT]*16777216 +g_updateBuffer[FLASH_ENERGY_POINT+1]*65536 + g_updateBuffer[FLASH_ENERGY_POINT+2]*256 + g_updateBuffer[FLASH_ENERGY_POINT+3]);
           rn8209c_papameter.lightTime     = (u32)(g_updateBuffer[FLASH_LIGHT_POINT]*16777216 +g_updateBuffer[FLASH_LIGHT_POINT+1]*65536 + g_updateBuffer[FLASH_LIGHT_POINT+2]*256 + g_updateBuffer[FLASH_LIGHT_POINT+3]);
           return true;
       }

       tempi -= ELC_FLIE_LEN;
       /* 保护时间到了以后，再去檫除数据区 */
   }
   
   return false;
}

/*****************************************************************************
 Prototype    : init_8209c_params
 Description  : 从flash中读取数据，初始化参数
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void init_8209c_params(void)
{
  
  /*************************************************************************
    flash file struct  file length = 17
    年 月 日 时 分 电量（4byte） PFcount(2byte) 亮灯时长（4byte） CRC(2byte)
    0              5            9              11               15
  
    FLASH_TIME_POINT,
    FLASH_ENERGY_POINT,
    FLASH_PFCOUNT_POINT,
    FLASH_LIGHT_POINT,
    FLASH_CRC_PINT,
    **************************************************************************/
  
  u16 length;
  u16 crcval;
  
  if (read_params_area(FLASH_PARAMETER_ADDRESS) == true)
  {
      if (find_params(PARAM_CAL, & rn8209c_papameter.calibration) )
      {
            /* 计量校准过，读取参数 */
            if (rn8209c_papameter.calibration == 1)
            {
                find_params(PARAM_PSTART, &rn8209c_papameter.PStart);
                find_params(PARAM_GPQA, &rn8209c_papameter.GPQA);
                find_params(PARAM_PHSA, &rn8209c_papameter.PhsA);
                find_params(PARAM_KU, &rn8209c_papameter.Ku);
                find_params(PARAM_KI, & rn8209c_papameter.KIa);
                find_params(7, & rn8209c_papameter.Kp);
                //find_params(PARAM_QPHCAL, &rn8209c_papameter.QPhsCal);
            

                /*read from flashA */
                length =   find_free_addr(FLASH_ELC_SAVE_ADDRESS);

                /* 存储长度正确 */
                if(  (length < (1024 - ELC_FILE_TAIL_LEN)) &&  (length > 0) )
                {
                    read_flash(FLASH_ELC_SAVE_ADDRESS + length - ELC_FLIE_LEN, (u8*)g_updateBuffer, ELC_FLIE_LEN);

                    crcval = (u16)((u16)g_updateBuffer[FLASH_CRC_PINT]*256 + g_updateBuffer[FLASH_CRC_PINT + 1]);

                    if (GetCRC16((u8*)g_updateBuffer,FLASH_CRC_PINT) == crcval)
                    {
                        flash_ok = true;
                        rn8209c_papameter.PFcount       = (u16)(g_updateBuffer[FLASH_PFCOUNT_POINT]*256 +g_updateBuffer[FLASH_PFCOUNT_POINT + 1]);
                        rn8209c_papameter.energyAPulse  = (u32)(g_updateBuffer[FLASH_ENERGY_POINT]*16777216 +g_updateBuffer[FLASH_ENERGY_POINT+1]*65536 + g_updateBuffer[FLASH_ENERGY_POINT+2]*256 + g_updateBuffer[FLASH_ENERGY_POINT+3]);
                        rn8209c_papameter.lightTime     = (u32)(g_updateBuffer[FLASH_LIGHT_POINT]*16777216 +g_updateBuffer[FLASH_LIGHT_POINT+1]*65536 + g_updateBuffer[FLASH_LIGHT_POINT+2]*256 + g_updateBuffer[FLASH_LIGHT_POINT+3]);
                    }
                    else
                    {   
                        /* 读取旧的flash数据，若成功，在保护时间到后，将此数据保存，若读取失败，则保护时间到后直接写入新数据 */
                      (find_old_data(length) == true)? (flash_ok = true):(flash_ok = false);
                    }
                } 
                else
                {
                    /* 存储长度失败，则直接檫除flash */
                    /* 是否做一个轮询flash的函数，错误直接轮询flash */
                    flash_ok = false;
                }
            }  
      }
      else
      {
         rn8209c_papameter.calibration = 0;
      } 
  }
  else
  {
     rn8209c_papameter.calibration = 0;
  }
 
  set_8209c_params();
}

/*****************************************************************************
 Prototype    : format_elc_data
 Description  : 组合电量保存数据
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void format_elc_data(void)
{
  
    /*************************************************************************
    flash file struct  file length = 17
    年 月 日 时 分 电量（4byte） PFcount(2byte) 亮灯时长（4byte） CRC(2byte)
    **************************************************************************/
  
    u16 crc;
    
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current date */
    RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);

    /* Get the RTC current time */
    RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);

    g_updateBuffer[0] = RTC_DateStructure.RTC_Year;
    g_updateBuffer[1] = RTC_DateStructure.RTC_Month;
    g_updateBuffer[2] = RTC_DateStructure.RTC_Date;
    g_updateBuffer[3] = RTC_TimeStructure.RTC_Hours;
    g_updateBuffer[4] = RTC_TimeStructure.RTC_Minutes;

