barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/gpio_per.c
    g_updateBuffer[5] = (u8)((rn8209c_papameter.energyAPulse >> 24) &0xFF);
    g_updateBuffer[6] = (u8)((rn8209c_papameter.energyAPulse >> 16) &0xFF);
    g_updateBuffer[7] = (u8)((rn8209c_papameter.energyAPulse >> 8) &0xFF);
    g_updateBuffer[8] = (u8)(rn8209c_papameter.energyAPulse & 0xFF);

    g_updateBuffer[9] = (u8)((rn8209c_papameter.PFcount >> 8) &0xFF);
    g_updateBuffer[10] = (u8)(rn8209c_papameter.PFcount & 0xFF);
    
    g_updateBuffer[11] = (u8)((rn8209c_papameter.lightTime >> 24) &0xFF);
    g_updateBuffer[12] = (u8)((rn8209c_papameter.lightTime >> 16) &0xFF);
    g_updateBuffer[13] = (u8)((rn8209c_papameter.lightTime >> 8) &0xFF);
    g_updateBuffer[14] = (u8)(rn8209c_papameter.lightTime & 0xFF);

    crc = GetCRC16((u8*)g_updateBuffer, 15);

    g_updateBuffer[15] = (u8)((crc >> 8) &0xFF);
    g_updateBuffer[16] = (u8)(crc & 0xFF);
    g_updateBuffer[17] = 0;
}

/*****************************************************************************
 Prototype    : save_elc_datas
 Description  : 平时保存电量数据函数
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void save_elc_datas(void)
{
    u16 length;

    format_elc_data();

    length = find_free_addr(FLASH_ELC_SAVE_ADDRESS );

    /*  直接存,保证最少一个存储空间留给掉电保存 */
    if ( length >= (1024 - ELC_FILE_TAIL_LEN - ELC_FLIE_LEN) )
    {
    FLASH_ErasePage(FLASH_ELC_SAVE_ADDRESS);
    length = 0;
    }

    FLASH_Write_chars( FLASH_ELC_SAVE_ADDRESS + length, (u8*)g_updateBuffer ,ELC_FLIE_LEN); 
    
}

/*****************************************************************************
 Prototype    : power_down_protect
 Description  : 掉电保护
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void power_down_protect(void)
{
    u32 temp;
    
    u16 length = find_free_addr(FLASH_ELC_SAVE_ADDRESS );
    
    rn8209c_papameter.PFcount = read_8209c_regs(ADPFCnt,&temp); 

    read_8209c_energyP();

    format_elc_data();
   
    temp = FLASH_ELC_SAVE_ADDRESS + length;
    
    FLASH_Write_chars(temp, (u8*)g_updateBuffer ,ELC_FLIE_LEN);
}

/*****************************************************************************
 Prototype    : read_UIP
 Description  : 读取电压，电流，功率
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void read_UIP(void)
{
    u32 temp;
    
    read_8209c_regs(ADURMS,&temp);
    rn8209c_papameter.Uv  =   ((temp & 0x800000) > 0) ? 0:(u16)(220.0*10/rn8209c_papameter.Ku*temp);
    read_8209c_regs(ADIARMS,&temp);
    rn8209c_papameter.Ia  =   ((temp & 0x800000) > 0) ? 0: (u32)(IB_05/rn8209c_papameter.KIa*temp*1000.0); 
    
    read_8209c_regs(ADPowerPA,&temp);
    if (temp & 0x80000000)
    {
      temp = (~temp + 1);
    }
    rn8209c_papameter.Pa = (u16)(rn8209c_papameter.Kp*temp/1000000.0);
}


/*****************************************************************************
 Prototype    : read_8209c_energyP
 Description  : 读取电量数据
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u32 read_8209c_energyP(void)
{
    u32 temp;

    read_8209c_regs(ADPFCnt,&temp);

    rn8209c_papameter.PFcount = temp;

    read_8209c_regs(ADEnergyP2,&temp);

    rn8209c_papameter.energyAPulse += temp;

    rn8209c_papameter.energyA = (u32)( (float)rn8209c_papameter.energyAPulse* 1000.0/rn8209c_papameter.EC );

    return  rn8209c_papameter.energyA;
   
}

/*****************************************************************************
 Prototype    : read_pow_factor
 Description  : 读取功率因数
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u8 read_pow_factor(void)
{
  u32 powP;
  u32 npowP;
  u8  factor;
  
  read_8209c_regs(ADPowerPA,&powP);
  read_8209c_regs(powerQ,&npowP);
  
  if (powP & 0x80000000)
  {
    powP = (~powP + 1);
  }
  powP = (u32)(rn8209c_papameter.Kp*powP /1000000.0);

  if (npowP & 0x80000000)
  {
    npowP = (~powP + 1);
  }
  
  npowP = (u32)(rn8209c_papameter.Kp*npowP /1000000.0);
  
  factor = (u8)( powP * 100.0 / sqrt(npowP*npowP + powP*powP));
  
  return factor;
}


/*****************************************************************************
 Prototype    : get_light_time
 Description  : 读取亮灯时长
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u32 get_light_time(void)
{
   if ((read_light_time() /60000) > 0)
   {
     rn8209c_papameter.lightTime += (read_light_time() /60000); 
     clear_light_time();
   }
   
   return rn8209c_papameter.lightTime;
}

/*****************************************************************************
 Prototype    : read_LED_state
 Description  : 判断灯状态
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
bool read_LED_state(void)
{
  /* 1 检测继电器，*/
  /* 2 检测继电器断开，灯关闭*/
  /* 3 继电器检测闭合，再检测实时电流*/
  /* 4 若电流检测状态与开关状态一致，则返回状态，若状态不一致，则报错 */
  if (rn8209c_papameter.pwmValue == 0)
  {
    return false;
  }
  else
  {
    return true;
  }
}










